In [2]:
from sqlalchemy import create_engine
import numpy as np
import pandas as pd

In [4]:
engine = create_engine('mysql+pymysql://root:123456@127.0.0.1:3306/testdb?charset=utf8')
datail = pd.read_sql_table('meal_order_detail1', con=engine)

d:\virtual\gll\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 480")
  result = self._query(query)

In [5]:
datail.index   # 获取索引

RangeIndex(start=0, stop=2779, step=1)

In [6]:
datail.values  # 获取值

array([['2956', '417', '610062', ..., 'NA', 'caipu/104001.jpg', '1442'],
       ['2958', '417', '609957', ..., 'NA', 'caipu/202003.jpg', '1442'],
       ['2961', '417', '609950', ..., 'NA', 'caipu/303001.jpg', '1442'],
       ...,
       ['6756', '774', '609949', ..., 'NA', 'caipu/404005.jpg', '1138'],
       ['6763', '774', '610014', ..., 'NA', 'caipu/302003.jpg', '1138'],
       ['6764', '774', '610017', ..., 'NA', 'caipu/302006.jpg', '1138']],
      dtype=object)

In [7]:
datail.columns # 获取列

Index(['detail_id', 'order_id', 'dishes_id', 'logicprn_name',
       'parent_class_name', 'dishes_name', 'itemis_add', 'counts', 'amounts',
       'cost', 'place_order_time', 'discount_amt', 'discount_reason',
       'kick_back', 'add_inprice', 'add_info', 'bar_code', 'picture_file',
       'emp_id'],
      dtype='object')

In [8]:
datail.dtypes   # 查看数据的所有类型

detail_id                    object
order_id                     object
dishes_id                    object
logicprn_name                object
parent_class_name            object
dishes_name                  object
itemis_add                   object
counts                      float64
amounts                     float64
cost                         object
place_order_time     datetime64[ns]
discount_amt                 object
discount_reason              object
kick_back                    object
add_inprice                  object
add_info                     object
bar_code                     object
picture_file                 object
emp_id                       object
dtype: object

In [9]:
datail.size    # 获取数据的个数

52801

In [10]:
datail.ndim  # 获取数据的维度

2

In [11]:
datail.shape   # 获取数据的形状

(2779, 19)

In [13]:
datail.T.shape  # 将数据进行矩阵转换

(19, 2779)

#### 增删查改DataFrame数据

In [15]:
order_id = datail['order_id']    # 字典形式访问
order_id

0       417
1       417
2       417
3       417
4       417
       ...
2774    774
2775    774
2776    774
2777    774
2778    774
Name: order_id, Length: 2779, dtype: object

In [17]:
dish = datail.dishes_name   # 以属性的方式访问
dish

0         蒜蓉生蚝
1        蒙古烤羊腿
2         大蒜苋菜
3        芝麻烤紫菜
4          蒜香包
         ...
2774     白饭/大碗
2775       牛尾汤
2776    意文柠檬汁
2777      金玉良缘
2778      酸辣藕丁
Name: dishes_name, Length: 2779, dtype: object

##### datafrme 单/多行数据获取，即一个series可以看成一个一维的数组

In [18]:
# 单列数据获取
dish2 = datail['dishes_name'][:5]    # 获取前五个
dish2

0     蒜蓉生蚝
1    蒙古烤羊腿
2     大蒜苋菜
3    芝麻烤紫菜
4      蒜香包
Name: dishes_name, dtype: object

In [20]:
# 多列数据获取时必须将所有的列索引放到一个列中
dish3 = datail[['order_id', 'dishes_name']][:5]
dish3

  order_id dishes_name
0      417        蒜蓉生蚝
1      417       蒙古烤羊腿
2      417        大蒜苋菜
3      417       芝麻烤紫菜
4      417         蒜香包

In [22]:
dish4 = datail[:][1:5]
dish4

,detail_id,order_id,dishes_id,logicprn_name,parent_class_name,dishes_name,itemis_add,counts,amounts,cost,place_order_time,discount_amt,discount_reason,kick_back,add_inprice,add_info,bar_code,picture_file,emp_id
1,2958,417,609957,NA,NA,蒙古烤羊腿,0,1.0,48.0,NA,2016-08-01 11:07:00,NA,NA,NA,0,NA,NA,caipu/202003.jpg,1442
2,2961,417,609950,NA,NA,大蒜苋菜,0,1.0,30.0,NA,2016-08-01 11:07:00,NA,NA,NA,0,NA,NA,caipu/303001.jpg,1442
3,2966,417,610038,NA,NA,芝麻烤紫菜,0,1.0,25.0,NA,2016-08-01 11:11:00,NA,NA,NA,0,NA,NA,caipu/105002.jpg,1442
4,2968,417,610003,NA,NA,蒜香包,0,1.0,13.0,NA,2016-08-01 11:11:00,NA,NA,NA,0,NA,NA,caipu/503002.jpg,1442

In [23]:
# 也可以使用head和tail从开始或者结尾获取连续的数据
datail.head()

,detail_id,order_id,dishes_id,logicprn_name,parent_class_name,dishes_name,itemis_add,counts,amounts,cost,place_order_time,discount_amt,discount_reason,kick_back,add_inprice,add_info,bar_code,picture_file,emp_id
0,2956,417,610062,NA,NA,蒜蓉生蚝,0,1.0,49.0,NA,2016-08-01 11:05:00,NA,NA,NA,0,NA,NA,caipu/104001.jpg,1442
1,2958,417,609957,NA,NA,蒙古烤羊腿,0,1.0,48.0,NA,2016-08-01 11:07:00,NA,NA,NA,0,NA,NA,caipu/202003.jpg,1442
2,2961,417,609950,NA,NA,大蒜苋菜,0,1.0,30.0,NA,2016-08-01 11:07:00,NA,NA,NA,0,NA,NA,caipu/303001.jpg,1442
3,2966,417,610038,NA,NA,芝麻烤紫菜,0,1.0,25.0,NA,2016-08-01 11:11:00,NA,NA,NA,0,NA,NA,caipu/105002.jpg,1442
4,2968,417,610003,NA,NA,蒜香包,0,1.0,13.0,NA,2016-08-01 11:11:00,NA,NA,NA,0,NA,NA,caipu/503002.jpg,1442

In [24]:
datail.tail()

,detail_id,order_id,dishes_id,logicprn_name,parent_class_name,dishes_name,itemis_add,counts,amounts,cost,place_order_time,discount_amt,discount_reason,kick_back,add_inprice,add_info,bar_code,picture_file,emp_id
2774,6750,774,610011,NA,NA,白饭/大碗,0,1.0,10.0,NA,2016-08-10 21:56:00,NA,NA,NA,0,NA,NA,caipu/601005.jpg,1138
2775,6742,774,609996,NA,NA,牛尾汤,0,1.0,40.0,NA,2016-08-10 21:56:00,NA,NA,NA,0,NA,NA,caipu/201006.jpg,1138
2776,6756,774,609949,NA,NA,意文柠檬汁,0,1.0,13.0,NA,2016-08-10 22:01:00,NA,NA,NA,0,NA,NA,caipu/404005.jpg,1138
2777,6763,774,610014,NA,NA,金玉良缘,0,1.0,30.0,NA,2016-08-10 22:03:00,NA,NA,NA,0,NA,NA,caipu/302003.jpg,1138
2778,6764,774,610017,NA,NA,酸辣藕丁,0,1.0,33.0,NA,2016-08-10 22:04:00,NA,NA,NA,0,NA,NA,caipu/302006.jpg,1138

#### 使用loc和iloc实现单/多列切片

In [26]:
dish = datail.loc[:,'dishes_name']   # 同过此方法获取此列
dish

0         蒜蓉生蚝
1        蒙古烤羊腿
2         大蒜苋菜
3        芝麻烤紫菜
4          蒜香包
         ...
2774     白饭/大碗
2775       牛尾汤
2776    意文柠檬汁
2777      金玉良缘
2778      酸辣藕丁
Name: dishes_name, Length: 2779, dtype: object

In [28]:
dish2 = datail.iloc[:, 2]
dish2

0       610062
1       609957
2       609950
3       610038
4       610003
         ...
2774    610011
2775    609996
2776    609949
2777    610014
2778    610017
Name: dishes_id, Length: 2779, dtype: object

In [29]:
orderDatil = datail.loc[:, ['order_id', 'dishes_name']]   # 多列切片
orderDatil

     order_id dishes_name
0         417        蒜蓉生蚝
1         417       蒙古烤羊腿
2         417        大蒜苋菜
3         417       芝麻烤紫菜
4         417         蒜香包
...       ...         ...
2774      774       白饭/大碗
2775      774         牛尾汤
2776      774      意文柠檬汁
2777      774        金玉良缘
2778      774        酸辣藕丁

[2779 rows x 2 columns]

In [30]:
orderDatil2 = datail.iloc[:, [1,3]]   # iloc 且指定位置的列
orderDatil2

     order_id logicprn_name
0         417            NA
1         417            NA
2         417            NA
3         417            NA
4         417            NA
...       ...           ...
2774      774            NA
2775      774            NA
2776      774            NA
2777      774            NA
2778      774            NA

[2779 rows x 2 columns]

#### loc和iloc的花式切片

In [31]:
# 切多个列指定的行数据
datail.loc[3,['order_id','dishes_name']]   # 此两列的第三行数据

order_id         417
dishes_name    芝麻烤紫菜
Name: 3, dtype: object

In [32]:
datail.loc[2:6, ['order_id','dishes_name']]  # 多列指定多行数据获取

  order_id dishes_name
2      417        大蒜苋菜
3      417       芝麻烤紫菜
4      417         蒜香包
5      301         白斩鸡
6      301        香烤牛排

In [33]:
datail.iloc[3,[1,3]]

order_id         417
logicprn_name     NA
Name: 3, dtype: object

In [34]:
datail.iloc[2:7, [1,3]]

  order_id logicprn_name
2      417            NA
3      417            NA
4      417            NA
5      301            NA
6      301            NA

#### 使用loc和iloc实现条件切片

In [36]:
datail.loc[datail['order_id']=='458', ['order_id', 'dishes_name']]   # 获取order_id为458的数据

    order_id dishes_name
145      458       蒜香辣花甲
146      458        剁椒鱼头
147      458     凉拌蒜蓉西兰花
148      458        木须豌豆
149      458        辣炒鱿鱼
150      458        酸辣藕丁
151      458       炝炒大白菜
152      458       香菇鸡肉粥
153      458        干锅田鸡
154      458     桂圆枸杞鸽子汤
155      458       五香酱驴肉
156      458    路易拉菲红酒干红
157      458       避风塘炒蟹
158      458       白饭/大碗

In [37]:
# 使用iloc实现条件切片
datail.iloc[(datail['order_id']=='458').values, [1,5]]   # 使用iloc条件获取时，必须将索引对应的值调出来比较，因为loc中返回的只是布尔值series

    order_id dishes_name
145      458       蒜香辣花甲
146      458        剁椒鱼头
147      458     凉拌蒜蓉西兰花
148      458        木须豌豆
149      458        辣炒鱿鱼
150      458        酸辣藕丁
151      458       炝炒大白菜
152      458       香菇鸡肉粥
153      458        干锅田鸡
154      458     桂圆枸杞鸽子汤
155      458       五香酱驴肉
156      458    路易拉菲红酒干红
157      458       避风塘炒蟹
158      458       白饭/大碗

#### 使用ix切片

In [38]:
datail.ix[2:6,5]  # 获取第5列中 2到6行的数据

d:\virtual\gll\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
d:\virtual\gll\lib\site-packages\pandas\core\indexing.py:961: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  return getattr(section, self.name)[new_key]

2     大蒜苋菜
3    芝麻烤紫菜
4      蒜香包
5      白斩鸡
6     香烤牛排
Name: dishes_name, dtype: object

### 更改DataFrame中的数据

In [41]:
# 首先，提取要更改的原始数据,
# 其次对提取出来的值整体赋值
# 数据更改是无法撤销的操作
datail.loc[datail['order_id']=='458', 'order_id'] = '45800'
datail.loc[datail['order_id'] == '45800', 'order_id']

145    45800
146    45800
147    45800
148    45800
149    45800
150    45800
151    45800
152    45800
153    45800
154    45800
155    45800
156    45800
157    45800
158    45800
Name: order_id, dtype: object

##### 增添数据

In [43]:
datail['payment'] = datail['counts']*datail['amounts']   # 新增加一列payment
datail['payment'].head()

0    49.0
1    48.0
2    30.0
3    25.0
4    13.0
Name: payment, dtype: float64

#### 删除某列
##### 需要调用drop方法
##### 参数说明  ：labels 代表删除的行或列  axis 接收0或1，代表横轴或纵轴  levels 代表标签所在的级别  inplace 接收Boolean，表示操作是否对原数据生效

In [44]:
datail.columns

Index(['detail_id', 'order_id', 'dishes_id', 'logicprn_name',
       'parent_class_name', 'dishes_name', 'itemis_add', 'counts', 'amounts',
       'cost', 'place_order_time', 'discount_amt', 'discount_reason',
       'kick_back', 'add_inprice', 'add_info', 'bar_code', 'picture_file',
       'emp_id', 'payment'],
      dtype='object')

In [45]:
datail.drop(labels='payment', axis=1, inplace=True)

In [46]:
datail.columns

Index(['detail_id', 'order_id', 'dishes_id', 'logicprn_name',
       'parent_class_name', 'dishes_name', 'itemis_add', 'counts', 'amounts',
       'cost', 'place_order_time', 'discount_amt', 'discount_reason',
       'kick_back', 'add_inprice', 'add_info', 'bar_code', 'picture_file',
       'emp_id'],
      dtype='object')

In [47]:
# 行删除
len(datail)

2779

In [48]:
datail.drop(labels=range(1,11),axis=0, inplace=True)

In [49]:
len(datail)

2769